[
    {
        "title": "Outlook Event Manager",
        "git_url": "https://github.com/rbshah29/outlook-manager",
        "description": "Outlook Event manager uses Graph API to fetch events from Outlook calendar and display them in a user-friendly way. It also allows users to create, update, and delete events.",
        "techs": ["Python", "Flask", "Microsoft Graph API","Docker"]
    },
    {
        "title": "Weather Forecast API",
        "git_url": "https://github.com/rbshah29/get-temp-backend",
        "description": "This project is a FastAPI web service that fetches and visualizes weather data based on latitude and longitude coordinates. It includes various API available in fastapi docs section.",
        "techs": ["Python", "Fast API", "Open Meteo API"]
    },
    {
        "title": "NoteKeep - Mimic of Google Keep",
        "git_url": "https://github.com/rbshah29/notekeep",
        "description": "This Notepad application, allows users to create, read, and delete notes. It also includes authentication and collaboration features with explicit permissions, search functionality, and uses MongoDB for data storage.",
        "techs": ["Node.js", "Nuxt.js", "Tailwind CSS", "MongoDB"]
    },
    {
        "title": "Firebase Backup Tool",
        "git_url": "https://github.com/rbshah29/firebase-backup",
        "description": "A command-line tool to backup and restore Firebase Firestore and Storage data. It uses Firebase Admin SDK to interact with Firebase services and allows users to schedule backups using cron jobs.",
        "techs": ["Firebase", "Terminal", "GCP"]
    },
    {
        "title": "Monitoring Dashboard",
        "git_url": "https://github.com/rbshah29/monitoring",
        "description": "A flexible monitoring solution that collects metrics from various sources and visualizes them in real-time dashboards. While this project includes rsnapshot backup monitoring as an example, you can send data from any source using simple curl commands or custom scripts.",
        "techs": ["Grafana", "Telegraf", "InfluxDB", "Traefik", "Bash Scripting"]
    }
]
