[
    {
        "id": "tabs-with-underline-1",
        "alias": "Evodev",
        "name": "Évodév Technologies Inc.",
        "duration": "Sept. 2024 - Present",
        "link": "https://www.evodev.ca/",
        "technology": "Python, JS, SQL Alchemy,  MySql, Microsoft Graph API, Docker, Flutter, Nuxt.js",
        "summary": "Developed and maintained cross-platform mobile applications using Flutter, integrated with Firebase and SQLite for efficient data handling. Designed and implemented database backup and restoration solutions, ensuring data integrity and minimizing downtime. Enhanced web applications for calibration systems and construction management, delivering client-requested updates and features.Integrated Microsoft Graph API with Outlook, enabling seamless calendar and event CRUD operations. Built tablet applications using Python and Buildozer, optimizing performance for field use. Led migration of legacy systems from Python 2.7 to 3.11, improving system performance, maintainability, and long-term support."
    },
    {
        "id": "tabs-with-underline-2",
        "alias": "CCSE",
        "name": "Cold Chain Science Enterprice",
        "duration": "Jan. 2024 - Sept. 2024",
        "link": "https://www.coldchainscience.com/",
        "technology": "Python, Nuxt.js, FastAPI, Java, JavaScript, SQL Alchemy, PostgreSQL, MongoDB, Google Map API, Docker",
        "summary": "Here I got to play with a modern stack — Python, FastAPI, Nuxt.js, PostgreSQL, MongoDB, and even Docker. I fixed performance issues in a Java monitoring system, then helped build a new project from scratch with a solid backend (FastAPI + SQLAlchemy) and a frontend powered by Nuxt.js and Tailwind CSS. Basically, I made sure things ran fast and looked good. Also, worked with Tailwind CSS and implemented Postgres as the database"
    },
    {
        "id": "tabs-with-underline-3",
        "alias": "TDG",
        "name": "The Dev Guys",
        "duration": "Sept. 2023 - Dec. 2023",
        "link": "https://www.thedevguys.in/",
        "technology": "Next.JS, Supabase, Prisma",
        "summary": "I worked on a web app with Next.js and Supabase, where I focused on debugging and polishing things up so users had a smoother experience (and actually stuck around longer). On the side, I built a fully responsive blog app with a clean dashboard for managing posts and bookmarks — and made sure it looked good and worked well on any screen.Enhanced the blog web app to be fully responsive, improving user engagement and increasing session duration"
    },
    {
        "id": "tabs-with-underline-4",
        "alias": "Brainvire",
        "name": "Brainvire Infotech Pvt. Ltd.",
        "duration": "Feb. 2021 - June 2022",
        "link": "https://www.brainvire.com/",
        "technology": "Python, Odoo, PostgreSQL, Prisma, Docker, XML, JavaScript",
        "summary": "I spent most of my time building out customer-specific features in Python and making the system more modular so it could scale better. I reworked PostgreSQL schemas to speed up queries, set up event-based monitoring for the POS app to catch issues quicker, and even built a framework that made it way easier to integrate new payment systems — cutting dev time down a lot."
    }
]
